IdeaRS.Connections
InternalForceOnSegmentData.BeamSegmentId Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the id of the beam
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int BeamSegmentId { get; set; }
Property Value
Type: Int32
See Also
Reference
InternalForceOnSegmentData Class
IdeaRS.Connections.Data Namespace